org/roam/firefox.org
:PROPERTIES:
:ID:       aae21430-637a-4b92-8f8a-d35e9991e396
:END:
#+title: firefox
#+OPTIONS: toc:nil num:nil date:nil \n:nil html-style:nil author:nil timestamp:nil title:nil html-postamble:nil html5-fancy:t
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="org-default.css" />
#+HTML_CONTENT_CLASS: container
#+HTML_DOCTYPE: html5
#+INCLUDE: "css.org::navbar" :only-contents t
* Firefox
** firefox
- about:config
  - esni is replaced by ech but not all servers support it
#+NAME: esni-ff
#+BEGIN_SRC conf :tangle no
network.dns.echconfig.enabled
network.dns.use_https_rr_as_altsvc
#+END_SRC
    - dns over https for 1.1.1.1 1.0.0.1
    - network.trr.mode 2
#+NAME: tor-cf-doh
#+BEGIN_SRC conf :tangle no
  https://dns4torpnlfs2ifuz2s2yf3fc7rdmsbhm6rw75euj35pac6ap25zgqad.onion/ (should be valid cert with alt-svc)
#+END_SRC
  - network.trr.uri https://tor.cloudflare-dns.com/dns-query
  - check: https://www.cloudflare.com/ssl/encrypted-sni/
  - ~dom.security.https_only_mode~
  - ~security.webauth.webauthn_enable_softtoken~ for webauthn softtokens
  - no PWA support on desktop
    - removed PWA support for SSB (adding to homescreen)
- lacks file system api
- color picker under 'More Tools' -> 'EyeDropper'
- responsive design mode for various device resolutions
- pdf editing tools
- ~MOZ_ENABLE_WAYLAND=1 firefox~ for wayland support
*** addons
- ublock origin
- multi account containers
- arkenfox user.js for config
  - user --ProfileManager to select profile
- read-aloud for pdf/epub reader
- https://profiler.firefox.com/ for power/perf flamegraph viewing
- [[https://addons.mozilla.org/en-US/firefox/addon/pwas-for-firefox/][pwa support addon]]

