firefox.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>firefox</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org-default.css" />
</head>
<body>
<div id="content" class="container">
<nav aria-label="breadcrumb" style="--pico-nav-breadcrumb-divider: '|';" id="orgfa29d3c">
<ul class="org-ul">
<li><a href="index.html#ID-3a34d6d7-6f37-4573-b20e-3c93894e54ac">🏠</a></li>
<li><a href="site_map.html#ID-30ea5e38-9b41-4bcd-8631-76821e93e294">🗺</a></li>
</ul>
</nav>
<div id="outline-container-org115ff8d" class="outline-2">
<h2 id="org115ff8d">Firefox</h2>
<div class="outline-text-2" id="text-org115ff8d">
</div>
<div id="outline-container-org8bf71cc" class="outline-3">
<h3 id="org8bf71cc">firefox</h3>
<div class="outline-text-3" id="text-org8bf71cc">
<ul class="org-ul">
<li>about:config
<ul class="org-ul">
<li>esni is replaced by ech but not all servers support it</li>
</ul></li>
</ul>
<div class="org-src-container">
<pre class="src src-conf" id="org20d5d37">network.dns.echconfig.enabled
network.dns.use_https_rr_as_altsvc
</pre>
</div>
<ul class="org-ul">
<li>dns over https for 1.1.1.1 1.0.0.1</li>
<li>network.trr.mode 2</li>
</ul>
<div class="org-src-container">
<pre class="src src-conf" id="org5a36748">https://dns4torpnlfs2ifuz2s2yf3fc7rdmsbhm6rw75euj35pac6ap25zgqad.onion/ (should be valid cert with alt-svc)
</pre>
</div>
<ul class="org-ul">
<li>network.trr.uri <a href="https://tor.cloudflare-dns.com/dns-query">https://tor.cloudflare-dns.com/dns-query</a></li>
<li>check: <a href="https://www.cloudflare.com/ssl/encrypted-sni/">https://www.cloudflare.com/ssl/encrypted-sni/</a></li>
<li><code>dom.security.https_only_mode</code></li>
<li><code>security.webauth.webauthn_enable_softtoken</code> for webauthn softtokens</li>
<li>no PWA support on desktop
<ul class="org-ul">
<li>removed PWA support for SSB (adding to homescreen)</li>
</ul></li>
</ul>
<ul class="org-ul">
<li>lacks file system api</li>
<li>color picker under 'More Tools' -&gt; 'EyeDropper'</li>
<li>responsive design mode for various device resolutions</li>
<li>pdf editing tools</li>
<li><code>MOZ_ENABLE_WAYLAND=1 firefox</code> for wayland support</li>
</ul>
</div>
<div id="outline-container-orgd1da7f2" class="outline-4">
<h4 id="orgd1da7f2">addons</h4>
<div class="outline-text-4" id="text-orgd1da7f2">
<ul class="org-ul">
<li>ublock origin</li>
<li>multi account containers</li>
<li>arkenfox user.js for config
<ul class="org-ul">
<li>user &#x2013;ProfileManager to select profile</li>
</ul></li>
<li>read-aloud for pdf/epub reader</li>
<li><a href="https://profiler.firefox.com/">https://profiler.firefox.com/</a> for power/perf flamegraph viewing</li>
<li><a href="https://addons.mozilla.org/en-US/firefox/addon/pwas-for-firefox/">pwa support addon</a></li>
</ul>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
